{
  "education": [
    {
      "awards_achievements": [
        "Developed an application for college Online Application.",
        "President's List (2020, 2021)",
        "GPA: 4.0/4.0"
      ],
      "degree": "Post Graduate Diploma",
      "department": "Mobile Application",
      "duration": "2020-2021",
      "school_name": "Cambrian College"
    },
    {
      "awards_achievements": [
        "Have won prizes in symposiums and college cultural fests.",
        "8.53/10 GPA"
      ],
      "degree": "Master of Engineering.",
      "department": "Computer Science and Engineering.",
      "duration": "2017-2019",
      "school_name": "VIT university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AshwinRishi",
  "highlighted_projects": [
    {
      "description": "Developed an appointment tracker that can chat and mail with the individual doctors. We can view and schedule appointments along with edit, deleting, inserting, and updating To-do List and notes. Built a secured login authentication with the blockchain along with JWT to improve the security by over 50%. Implemented a Covid-tracker with news updates along with the calendar of events for each specific event.",
      "git_url": "https://github.com/ashwinrishipj/HMS",
      "name": "Hospital Management System."
    },
    {
      "description": "have used JavaScript to build a To-do List that stores completed and pending task lists. Implemented the background using particle-js and Bootstrap to align the view for Mobile and web layout. Stores the data in local storage and retrieves the data each time an update is made on to the list \u0026 news data with animation with logout in HTML file.",
      "git_url": "https://github.com/ashwinrishipj/netlify-todo",
      "name": "News Display \u0026 To-do List:"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Monitoring Agent Program to help the LCA (The Jarvis Linux Cluster Administration). The LCA team has a specific set of bash scripts/files being run on the server. Our program helps to reveal the hardware information and resource usage to these servers. Additionally, with the help of the crontab command, the bash runs for every minute and inserts the data in PostgreSQL. Below is the set of sub-sections to glance more at the Project.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitor."
    }
  ],
  "name": "Ashwin Rishi",
  "others": [
    {
      "bullets": [
        "LinkedIn Certificate(ReactJs)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Second prize in robotics competition"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Reading Poems and novels",
        "playing Archery and Cricket"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Have been working on multiple products and sprint backlogs. Developed and tested, and deployed Linux, Java, and DevOps projects. Have used docker to implement projects.",
      "duration": "2021 - present",
      "title": "Software Developer."
    },
    {
      "company": "Cerner Corporation.",
      "description": "Refined and improved the existing code for the Scheduling of user appointments in the revenue cycle team Iteration with continuous Integration of GIT and with AGILE working development ensuring that the coding standards being followed. Developed an Appointment Scheduler Application as part of Industrial training using the JAX-RS(REST -API) with React JS and provided to the user with concurrent handles of 400 users. Have drafted Unit testing related to the APIs from JAX-RS with more than 90% test coverage and authored in peer code reviews for the features and bugs tagged in JIRA. Wrote highly maintainable, solid code for the software system, forming a core framework and earning consistent praise from subsequent developers since initial version.",
      "duration": "2018 - 2019",
      "title": "Software Developer."
    },
    {
      "company": "GUVI Geek Networks, IITM Research Park, India",
      "description": "Have graduated along with the other Trainees from various firms during this Bootcamp Training. Had great exposure to one of the world renowned developers teaching us the architecture scaling and Internal event loops in JavaScript and also code coverages of Junits. Been in Zen Class to Code continuously to achieve coding tasks and completions that's due on every week. Almost 13 to 15 hrs of coding everyday. Have developed full stack applications on HTML , CSS , Bootstrap , JavaScript, ReactJs , Node.js , Git and deployed multiple applications into AWS cloud.Lectured on topics of Event Loop and call-backs and hoisting in JavaScript to the ZenClass students. Developed, coded, modified and debugged application programs of varying degree of complexity with full independence.",
      "duration": "2019 - 2020",
      "title": "Software Engineering Immersive(Trainee)."
    }
  ],
  "skills": {
    "competent": [
      "Angular",
      "HTML/css",
      "GraphIql",
      "Jenkins",
      "Crucible",
      "Junits"
    ],
    "familiar": [
      "MongoDb",
      "Neo4j",
      "Python",
      "R",
      "Android Development"
    ],
    "proficient": [
      "Java",
      "SpringBoot/Jax-rs",
      "NodeJs",
      "React Js, BootStrap",
      "RDBMS/SQL",
      "Junits/Mockito",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Full stack developer possessing demonstrated acumen in designing, developing, and maintaining web, desktop, and mobile applications. Passionate to learn new skills and to seek to leverage broad-development experience in a challenging role."
}
